In [1]:
#pandas
import pandas as pd
s1=pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [17]:
import pandas as pd
s1=pd.Series([10,20,30,40,50])
s1
s1.size
s1.empty
s2.count()

np.int64(5)

In [21]:
s2.head(3) #default will give top 5

10    1
20    2
30    3
dtype: int64

In [23]:
s2.tail(3)

30    3
40    4
50    5
dtype: int64

In [14]:
#arthmetic operations
import pandas as pd
a1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
a1
#a1["c"]
#a1[0:3]
a1["a":"d"]
#a1.name="student data"
#a1
a1.index.name="values"
a1
a1.values

array([1, 2, 3, 4, 5])

In [8]:
s1=pd.Series([10,20,30,40],index=['a','b','c','d'])
s1

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
# by using numpy
import numpy as np
import pandas as pd
a1=np.array([1,2,3,4,5])
s2=pd.Series(a1,index=[10,20,30,40,50])
s2

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [6]:
s2[10:30]

Series([], dtype: int64)

In [13]:
#creation of series from dictionary
import pandas as pd
d1={1:'a',2:'b',3:'c'}
s3=pd.Series(d1)
s3

1    a
2    b
3    c
dtype: object

In [23]:
import pandas as pd
h1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
h2=pd.Series([6,7,8,9,10],index=['a','c','b','d','f'])
#h1+h2
#h1.add(h2,fill_value=5)
#h1-h2
#h1.sub(h2,fill_value=0)
h1*h2

a     6.0
b    16.0
c    21.0
d    36.0
e     NaN
f     NaN
dtype: float64

In [26]:
#Data Frame
#data frame is used to create the 2D arrays
import pandas as pd
g1=pd.DataFrame()#empty dataframe
g1

Empty DataFrame
Columns: []
Index: []

In [30]:
import numpy as np
import pandas as pd
a1=np.array([1,2,3])
a2=np.array([4,5,6])
a3=np.array([7,8,9])
d1=pd.DataFrame([a1,a2,a3],columns=["sub1","sub2","sub3"])
d1

   sub1  sub2  sub3
0     1     2     3
1     4     5     6
2     7     8     9

In [33]:
#creation using dictionaries
l=[{1:10,2:20,3:30},{1:40,2:50,3:60}]
d3=pd.DataFrame(l)
d3

    1   2   3
0  10  20  30
1  40  50  60

In [34]:
#dictionary of lists
d1={1:[10,20],2:[30,40],3:[50,60]}
d4=pd.DataFrame(d1)
d4

    1   2   3
0  10  30  50
1  20  40  60

In [35]:
#From series
s1=pd.Series([1,2,3])
s2=pd.Series([4,5,6])
d1=pd.DataFrame([s1,s2])
d1

   0  1  2
0  1  2  3
1  4  5  6

In [36]:
#adding cols
d1[3]=[20,30]
d1

   0  1  2   3
0  1  2  3  20
1  4  5  6  30

In [42]:
#adding rows
d1.loc[2]=[2,3,4,5]
d1

    0  1  2   3
0   1  2  3  20
1   4  5  6  30
2   2  3  4   5
3   2  3  4   5
10  2  3  4   5

In [53]:
#rename
s=d1.rename({0:"s1",1:"s2",2:"s3",3:"s4"},axis=0)
s
s.drop(10)
s1=s.rename({0:"s11",1:"s22",2:"s33",3:"s44"},axis=1)
s1

    s11  s22  s33  s44
s1    1    2    3   20
s2    4    5    6   30
s3    2    3    4    5
s4    2    3    4    5
10    2    3    4    5